Revit 2027 API
IFCImportOptions.Action Property
 The action of the import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCImportAction Action { get; set; }
Public Property Action As IFCImportAction
	Get
	Set
public:
property IFCImportAction Action {
	IFCImportAction get ();
	void set (IFCImportAction value);
}
member Action : IFCImportAction with get, set
Property Value
IFCImportAction
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace